Repository: devvsima/dating-bot
Catalog: locales/*/LC_MESSAGES/bot.po
Languages: es

source: Привет! 👋 Добро пожаловать в наш бот знакомств Michi! 💕 Чтобы начать, создай свой профиль — это просто и быстро. Желаем тебе приятных знакомств и интересных встреч!
es: ¡Hola! 👋 ¡Bienvenido a nuestro bot de citas Michi! 💕 Para empezar, crea tu perfil: es fácil y rápido. ¡Te deseamos agradables citas y encuentros interesantes!

source: 👋 Немного информации о боте: Этот бот был создан по аналогии с популярным ботом для знакомств <a href='https://t.me/leomatchbot?start=i_VwRd0'>Дайвинчик</a> Весь код бота открыт и доступен на <a href='https://github.com/devvsima/dating-bot'>GitHub</a> По вопросам и предложениям можно писать сюда: @devvsima.
es: 👋 Un poco de información sobre el bot: Este bot fue creado a lo largo de las líneas de un bot de citas populares Todo el código del bot está abierto y disponible en <a href='https://github.com/devvsima/dating-bot'>GitHub</a> Para preguntas y sugerencias puedes escribir aquí: @devvsima.

source: 🔍 Смотреть анкеты 👤 Моя анкета 📭 Кто меня лайкнул ✉️ Пригласить друзей
es: 🔍 Ver perfiles 👤 Mi perfil 📭 Quién me dio “me gusta” ✉️ Invitar a amigos

source: 🔄 Заполнить анкету заново 🖼 Изменить фотографию ✍️ Изменить описание ❌ Отключить анкету ↩️ Назад
es: 🔄 Rellenar el formulario de nuevo. 🖼 Cambiar la foto. ✍️ Cambiar la descripción. ❌ Desactivar el perfil. ↩️ Atrás

source: Неизвестная команда. Если заблудился, напиши /start.
es: Comando desconocido. Si te pierdes, escribe /start.

source: Укажи, свой пол: 👤
es: Indique su sexo: 👤

source: Выбери, кого ты ищешь: 💕
es: Elige a quien buscas 💕

source: Загрузи своё фото! Можно отправить до 3 фотографий одновременно 📸
es: ¡Sube tu foto! Puedes enviar hasta 3 fotos a la vez 📸

source: Как тебя зовут? ✍️
es: ¿Cómo te llamas? ✍️

source: Сколько тебе лет? 🎂
es: ¿Cuántos años tienes? 🎂

source: Укажи свой город: 🏙️
es: Introduzca su ciudad: 🏙️

source: Расскажи немного о себе — это поможет другим узнать тебя лучше! 📝
es: Tell us a little bit about yourself — it will help others get to know you better! 📝

source: Отлично! Твой профиль готов — теперь можешь искать интересных для себя людей 💬
es: ¡¡¡Genial!!! Tu perfil está listo - ahora puedes buscar gente interesante 💬

source: ❌ Твоя анкета отключена, некоторые функции теперь недоступны. 💬 Чтобы снова активировать анкету, отправь команду /start.
es: ❌ Tu perfil está desactivado, algunas funciones ahora no están disponibles. 💬 Para volver a activar tu perfil, envía el comando /start.

source: ✅ Твоя анкета успешно восстановлена! Теперь ты снова можешь пользоваться ботом.
es: ✅ ¡Tu perfil ha sido restaurado con éxito! Ahora puedes volver a utilizar el bot.

source: 🔍 Выполняется поиск...
es: 🔍 Buscando...

source: Твоя анкета понравилась {} людям! Давай посмотрим, кто это:
es: ¡A tu perfil le han gustado {} personas! Veamos quién es:

source: Подходящих анкет не найдено. Попробуй выбрать другой город. 🌍
es: No suitable profiles found. Try selecting another city. 🌍

source: Анкеты закончились. Попробуй позже! 😊
es: The questionnaires are finished. Try again later! 😊

source: Твоя анкета получила <b>{}</b> ❤️ 📭 Нажми, чтобы посмотреть
es: Tu perfil tiene <b>{}</b> ❤️ 📭 Haz clic para ver

source: Пока никто не поставил тебе лайк, но всё ещё впереди!
es: ✅ Your complaint has been successfully submitted for review!

source: Надеюсь вы хорошо проведете время ;) <a href='{}'>{}</a>
es: Espero que lo pases bien ;) <a href='{}'>{}</a>

source: Сообщение для тебя: {}
es: Mensaje para ti: {}

source: Можешь написать пользователю, до 250 символов. ✉️ Если не хочешь писать, нажми на кнопку ниже.
es: Puedes escribir al usuario, hasta 250 caracteres. ✉️ Si no quieres escribir, haz clic en el botón de abajo.

source: Отправил сообщение, ждем ответа.
es: Envié un mensaje, esperando respuesta.

source: Не корректное сообщение. Пожалуйста, напиши до 250 символов.
es: Mensaje incorrecto. Por favor, escribe hasta 250 caracteres.

source: Хорошо, ничего не буду отправлять.
es: Vale, no enviaré nada.

source: Некорректный ответ. Пожалуйста, выбери на клавиатуре или напиши правильно. 📝
es: Respuesta incorrecta. Por favor, elija en su teclado o escríbala correctamente. 📝

source: Превышен лимит символов. Пожалуйста, сократи сообщение. ✂️
es: Se ha superado el límite de caracteres. Por favor, acorte el mensaje. ✂️

source: Некорректное имя. Имя должно содержать минимум 2 буквы и максимум 70 символов. ✍️
es: Nombre incorrecto. El nombre debe contener un mínimo de 2 letras y un máximo de 70 caracteres. ✍️

source: Такой город не найден 😔
es: No se ha encontrado ninguna ciudad con ese nombre 😔

source: Неверный формат фотографии! Пожалуйста, загрузите изображение в правильном формате. 🖼️
es: ¡Formato de imagen incorrecto! Por favor, suba la imagen en el formato correcto. 🖼️

source: Неверный формат, возраст нужно указывать цифрами. 🔢
es: Formato incorrecto, la edad debe darse en números. 🔢

source: Приглашай друзей и получай бонусы! Приглашенные пользователи: <b>{}</b> Ссылка для друзей: <code>{}</code>
es: ¡Invita a tus amigos y consigue bonificaciones! Usuarios invitados:<b>{}</b>\ Enlace para amigos: <code>{}</code>

source: Наш канал: {}
es: Nuestro canal: {}

source: Выбери язык бота, на который хочешь переключиться: 🌐
es: Elige el idioma del bot al que quieres cambiar: 🌐

source: Язык бота изменён! ✅
es: ¡Se ha cambiado el bot de idioma! ✅

source: Укажи причину жалобы: 🔞 Неприличный контент 💰 Реклама 🔫 Другое ↩️ Назад
es: Indique el motivo de la queja: 🔞 Contenido inapropiado 💰 Publicidad 🔫 Otro ↩️ Atrás

source: ✅ Жалоба успешно отправлена на рассмотрение!
es: ✅ ¡La queja se ha enviado correctamente para su revisión!

source: Загрузи новые фото! Можно отправить до 3 фотографий 📸
es: ¡Sube nuevas fotos! Puedes enviar hasta 3 fotos 📸

source: Фотографии остались без изменений
es: Las fotos permanecen inalteradas

source: Вы не загрузили ни одного фото. Попробуйте еще раз.
es: No has subido ninguna foto. Inténtalo de nuevo.

source: ❌ Ошибка при сохранении фото. Попробуйте еще раз.
es: ❌ Error al guardar una foto. Inténtalo de nuevo.

source: Это все, сохранить фото
es: Eso es todo, guardar foto

source: 📸 Фото {current}/{total} загружено! Можете загрузить еще {remaining} фото или нажать '{finish_button}'
es: 📸 Foto {current}/{total} subida. Puedes subir {remaining} foto(s) más o pulsar '{finish_button}'

source: Сохранено {} фото!
es: ¡{} foto(s) guardada(s)!

source: Все {} фото загружены!
es: ¡Todas las {} fotos subidas!

source: ❌ Максимум 3 фото! Нажмите 'Это все, сохранить фото' для сохранения.
es: ❌ ¡Máximo 3 fotos! Pulsa 'Eso es todo, guardar foto' para guardar.

source: 📸 Отправьте фотографию или выберите действие из меню
es: 📸 Envía una foto o elige una acción del menú

source: ❌ Для создания профиля необходимо загрузить хотя бы одно фото!
es: ❌ ¡Para crear un perfil, debes subir al menos una foto!

source: ⏳ Вы отправляете сообщения слишком часто. Пожалуйста, подождите пару секунд.
es: ⏳ Estás enviando mensajes con demasiada frecuencia. Por favor, espera unos segundos.

source: Создать анкету
es: Créer un profil

source: Парень
es: Chico

source: Девушка
es: Chica

source: Парней
es: Chicos

source: Девушек
es: Chicas

source: Всех
es: Todos

source: Оставить предыдущее
es: Laisser le précédent

source: Пропустить
es: Saltar

source: 📍 Отправить местоположение
es: 📍 Enviar ubicación

source: Посмотреть
es: Ver
