Repository: devvsima/dating-bot
Catalog: data/locales/*/LC_MESSAGES/bot.po
Languages: es, fr, id, pl, uk

source: Привет! 👋 Добро пожаловать в наш бот знакомств Michi! 💕 Чтобы начать, создай свой профиль — это просто и быстро. Желаем тебе приятных знакомств и интересных встреч!
fr: Salut ! 👋 Bienvenue dans notre bot de rencontres Michi ! 💕 Pour commencer, crée ton profil — c'est simple et rapide. Nous te souhaitons de belles rencontres et des rendez-vous intéressants !
id: Halo! 👋 Selamat datang di bot kencan Michi! 💕 Untuk memulai, buat profilmu — mudah dan cepat. Semoga kamu mendapatkan pertemanan dan pertemuan yang menyenangkan!
pl: Cześć 👋 Witamy w naszym bocie randkowym Michi! 💕 Aby rozpocząć, utwórz swój profil - to szybkie i łatwe. Życzymy udanych randek i ciekawych spotkań!
uk: Привіт! 👋 Ласкаво просимо в наш бот знайомств Michi! 💕 Щоб почати, створи свій профіль - це просто і швидко. Бажаємо тобі приємних знайомств і цікавих зустрічей!

source: 👋 Немного информации о боте: Этот бот был создан по аналогии с популярным ботом для знакомств <a href='https://t.me/leomatchbot?start=i_VwRd0'>Дайвинчик</a> Весь код бота открыт и доступен на <a href='https://github.com/devvsima/dating-bot'>GitHub</a> По вопросам и предложениям можно писать сюда: @devvsima.
es: 👋 Un poco de información sobre el bot: Este bot fue creado a lo largo de las líneas de un bot de citas populares Todo el código del bot está abierto y disponible en <a href='https://github.com/devvsima/dating-bot'>GitHub</a> Para preguntas y sugerencias puedes escribir aquí: @devvsima.
fr: 👋 Quelques informations sur le robot : Ce robot a été créé à l'instar d'un robot de rencontre populaire <a href='https://t.me/leomatchbot?start=i_VwRd0'>Leo</a> Tout le code du robot est ouvert et disponible à l'adresse suivante <a href='https://github.com/devvsima/dating-bot'>GitHub</a> Pour toute question ou suggestion, vous pouvez écrire ici @devvsima.
id: 👋 Sedikit informasi tentang bot: Bot ini dibuat berdasarkan bot kencan populer <a href='https://t.me/leomatchbot?start=i_VwRd0'>Дайвинчик</a> Seluruh kode bot terbuka dan tersedia di <a href='https://github.com/devvsima/dating-bot'>GitHub</a> Untuk pertanyaan dan saran, silakan hubungi: @devvsima.
pl: 👋 Trochę informacji o bocie: Ten bot został stworzony na wzór popularnego bota randkowego <a href='https://t.me/leomatchbot?start=i_VwRd0'>Dajwinczyk</a>. Cały kod bota jest otwarty i dostępny na <a href='https://github.com/devvsima/dating-bot'>GitHub</a>. W razie pytań lub sugestii możesz napisać tutaj: @devvsima.
uk: 👋 Трохи інформації про бота: Цей бот був створений за аналогією з популярним ботом для знайомств <a href='https://t.me/leomatchbot?start=i_VwRd0'>Дайвінчик</a> Весь код бота відкритий і доступний на <a href='https://github.com/devvsima/dating-bot'>GitHub</a> З питань і пропозицій можна писати сюди: @devvsima.

source: 🔍 Смотреть анкеты 👤 Моя анкета 📭 Кто меня лайкнул ✉️ Пригласить друзей
fr: 🔍 Voir les profils 👤 Mon profil 📭 Qui m'a aimé ✉️ Inviter des amis
id: 🔍 Lihat profil 👤 Profil saya 📭 Siapa yang menyukai saya ✉️ Undang teman
pl: wyświetl profile mój profil kto mnie polubił ✉️ Zaproś znajomych
uk: 🔍 Дивитися анкети 👤 Моя анкета 📭 Хто мене лайкнув ✉️ Запросити друзів

source: 🔄 Заполнить анкету заново 🖼 Изменить фотографию ✍️ Изменить описание ❌ Отключить анкету ↩️ Назад
fr: 🔄 Remplir à nouveau le questionnaire 🖼 Modifier la photo ✍️ Modifier la description ❌ Désactiver le questionnaire ↩️ Retour
id: 🔄 Isi ulang profil 🖼 Ubah foto ✍️ Ubah deskripsi ❌ Nonaktifkan profil ↩️ Kembali
pl: 🔄 Wypełnij formularz ponownie zmień zdjęcie ✍️ Zmień opis dezaktywuj profil 🔄 Заполнить анкету заново 🖼 Изменить фотографию ✍️ Изменить описание ❌ Отключить анкету ↩️ Wstecz
uk: 🔄 Заповнити анкету заново 🖼 Змінити фотографію ✍️ Змінити опис ❌ Відключити анкету ↩️ Назад

source: Неизвестная команда. Если заблудился, напиши /start.
fr: Commande inconnue. Si vous vous perdez, écrivez /start.
id: Perintah tidak dikenal. Jika bingung, ketik /start.
pl: Nieznane polecenie. Jeśli się zgubisz, napisz /start.
uk: Невідома команда. Якщо заблукав, напиши /start.

source: Укажи, свой пол: 👤
es: Indique su sexo: 👤
fr: Indiquez votre sexe: 👤
id: Pilih jenis kelaminmu: 👤
pl: Proszę podać swoją płeć: 👤
uk: Вкажи, свою стать: 👤

source: Выбери, кого ты ищешь: 💕
es: Elige a quien buscas 💕
fr: Choisissez qui vous cherchez 💕
id: Pilih siapa yang kamu cari: 💕
pl: Wybierz kogo szukasz: 💕
uk: Вибери, кого ти шукаєш: 💕

source: Загрузи своё фото! Можно отправить до 3 фотографий одновременно 📸
fr: Téléchargez votre photo ! Vous pouvez envoyer jusqu'à 3 photos en même temps 📸
id: Unggah fotomu! Kamu bisa mengirim hingga 3 foto sekaligus 📸
pl: Prześlij swoje zdjęcie! Możesz wysłać do 3 zdjęć jednocześnie 📸
uk: Завантаж своє фото! Можна відправити до 3 фотографій одночасно 📸

source: Как тебя зовут? ✍️
es: ¿Cómo te llamas? ✍️
fr: Quel est votre nom ? ✍️
id: Siapa namamu? ✍️
pl: Jak masz na imię? ✍️
uk: Як тебе звати? ✍️

source: Сколько тебе лет? 🎂
es: ¿Cuántos años tienes? 🎂
fr: Quel âge avez-vous ? 🎂
id: Berapa umurmu? 🎂
pl: Ile masz lat? 🎂
uk: Скільки тобі років? 🎂

source: Укажи свой город: 🏙️
es: Introduzca su ciudad: 🏙️
fr: Saisissez votre ville: 🏙️
id: Tulis kotamu: 🏙️
pl: Podaj swoje miasto: 🏙️
uk: Вкажи своє місто: 🏙️

source: Расскажи немного о себе — это поможет другим узнать тебя лучше! 📝
fr: Parle-nous un peu de toi, ça aidera les autres à mieux te connaître ! 📝
id: Ceritakan sedikit tentang dirimu — ini membantu orang lain mengenalmu! 📝
pl: Opowiedz nam trochę o sobie - to pomoże innym lepiej Cię poznać! 📝
uk: Розкажи трохи про себе — це допоможе іншим краще тебе пізнати! 📝

source: Отлично! Твой профиль готов — теперь можешь искать интересных для себя людей 💬
fr: Génial ! Votre profil est prêt - vous pouvez maintenant rechercher des personnes intéressantes 💬
id: Profilmu sudah siap — sekarang kamu bisa mencari orang menarik 💬
pl: Świetnie! Twój profil jest gotowy - teraz możesz wyszukiwać interesujące osoby 💬
uk: Чудово! Твій профіль готовий - тепер можеш шукати цікавих для себе людей 💬

source: ❌ Твоя анкета отключена, некоторые функции теперь недоступны. 💬 Чтобы снова активировать анкету, отправь команду /start.
fr: ❌ Votre profil est désactivé, certaines fonctionnalités ne sont plus disponibles. 💬 Pour réactiver votre profil, envoyez la commande /start.
id: ❌ Profilmu dinonaktifkan, beberapa fitur tidak tersedia. 💬 Untuk mengaktifkan kembali profil, kirim perintah /start.
pl: twój profil został dezaktywowany i niektóre funkcje nie są już dostępne. aby ponownie aktywować profil, wyślij polecenie /start.
uk: ❌ Твоя анкета відключена, деякі функції тепер недоступні. 💬 Щоб знову активувати анкету, надішли команду /start.

source: ✅ Твоя анкета успешно восстановлена! Теперь ты снова можешь пользоваться ботом.
es: ✅ ¡Tu perfil ha sido restaurado con éxito! Ahora puedes volver a utilizar el bot.
fr: ✅ Votre profil a été restauré avec succès ! Vous pouvez maintenant utiliser le bot à nouveau.
id: ✅ Profilmu berhasil dipulihkan! Kamu bisa menggunakan bot lagi.
pl: ✅ Twój profil został pomyślnie przywrócony! Teraz możesz ponownie używać bota.
uk: ✅ Твою анкету успішно відновлено! Тепер ти знову можеш користуватися ботом.

source: 🔍 Выполняется поиск...
es: 🔍 Buscando...
fr: 🔍 Recherche...
id: 🔍 Sedang mencari...
pl: 🔍 Wyszukiwanie...
uk: 🔍 Виконується пошук...

source: Твоя анкета понравилась {} людям! Давай посмотрим, кто это:
fr: Votre profil a été aimé par {} personnes ! Voyons de qui il s'agit :
id: Profilmu disukai oleh {} orang! Mari lihat siapa saja:
pl: Twój profil został polubiony przez {} osób! Zobaczmy, kto to jest:
uk: Твоя анкета сподобалася {} людям! Давай подивимося, хто це:

source: Подходящих анкет не найдено. Попробуй выбрать другой город. 🌍
fr: Aucun profil correspondant n'a été trouvé. Essayez de choisir une autre ville. 🌍
id: Tidak ada profil yang cocok ditemukan. Coba pilih kota lain. 🌍
pl: Nie znaleziono odpowiednich profili. Spróbuj wybrać inne miasto. 🌍
uk: Відповідних анкет не знайдено. Спробуй вибрати інше місто. 🌍

source: Анкеты закончились. Попробуй позже! 😊
fr: Les questionnaires sont terminés. Réessayez plus tard ! 😊
id: Profil sudah habis. Coba lagi nanti! 😊
pl: Kwestionariusze zostały wyczerpane. Spróbuj ponownie później! 😊
uk: Анкети закінчилися. Спробуй пізніше! 😊

source: Твоя анкета получила <b>{}</b> ❤️ 📭 Нажми, чтобы посмотреть
fr: Votre profil a obtenu <b>{}</b> ❤️ 📭 Click to view
id: Profilmu mendapat <b>{}</b> ❤️ 📭 Klik untuk melihat
pl: Twój profil został <b>{}</b> ❤️ 📭 Kliknij, aby wyświetlić
uk: Твоя анкета отримала <b>{}</b> ❤️ 📭 Натисни, щоб подивитися

source: Пока никто не поставил тебе лайк, но всё ещё впереди!
fr: Personne ne t'a encore liké, mais tout est encore possible !
id: Belum ada yang menyukaimu, tapi semuanya masih mungkin!
pl: Nikt jeszcze nie dał ci like'a, ale będzie ich jeszcze więcej!
uk: Поки що ніхто не поставив тобі лайк, але все ще попереду!

source: Надеюсь вы хорошо проведете время ;) <a href='{}'>{}</a>
fr: J'espère que vous passerez un bon moment ;) <a href='{}'>{}</a>
id: Semoga kalian bersenang-senang ;) <a href='{}'>{}</a>
pl: Mam nadzieję, że dobrze się bawiliście ;) <a href='{}'>{}</a>
uk: Сподіваюся, ви добре проведете час ;) <a href='{}'>{}</a>

source: Сообщение для тебя: {}
fr: Message pour toi : {}
id: Pesan untukmu: {}
pl: Wiadomość dla Ciebie: {}
uk: Повідомлення для тебе: {}

source: Можешь написать пользователю, до 250 символов. ✉️ Если не хочешь писать, нажми на кнопку ниже.
fr: Vous pouvez écrire au utilisateur, jusqu'à 250 caractères. ✉️ Si vous ne souhaitez pas écrire, cliquez sur le bouton ci-dessous.
id: Kamu bisa menulis pesan hingga 250 karakter. ✉️ Jika tidak ingin menulis, klik tombol di bawah.
pl: Możesz napisać do użytkownika, maksymalnie 250 znaków. ✉️ Jeśli nie chcesz pisać, kliknij przycisk poniżej.
uk: Можеш написати користувачеві, до 250 символів. ✉️ Якщо не хочеш писати, натисни на кнопку нижче.

source: Отправил сообщение, ждем ответа.
fr: J'ai envoyé un message, j'attends une réponse.
id: Pesan dikirim, tunggu balasan.
pl: Wysłałem wiadomość, czekam na odpowiedź.
uk: Відправив повідомлення, чекаємо відповіді.

source: Не корректное сообщение. Пожалуйста, напиши до 250 символов.
fr: Message incorrect. Veuillez écrire jusqu'à 250 caractères.
id: Pesan tidak valid. Silakan tulis hingga 250 karakter.
pl: Nieprawidłowa wiadomość. Proszę wpisać maksymalnie 250 znaków.
uk: Некоректне повідомлення. Будь ласка, напиши до 250 символів.

source: Хорошо, ничего не буду отправлять.
fr: D'accord, je n'enverrai rien.
id: Baik, tidak akan mengirim apa pun.
pl: Dobra, nic nie wyślę.
uk: Добре, нічого не буду надсилати.

source: Некорректный ответ. Пожалуйста, выбери на клавиатуре или напиши правильно. 📝
es: Respuesta incorrecta. Por favor, elija en su teclado o escríbala correctamente. 📝
fr: Réponse incorrecte. Veuillez sélectionner sur votre clavier ou l'écrire correctement. 📝
id: Jawaban tidak valid. Silakan pilih di keyboard atau tulis dengan benar. 📝
pl: Nieprawidłowa odpowiedź. Proszę wybrać na klawiaturze lub napisać poprawnie. 📝
uk: Некоректна відповідь. Будь ласка, вибери на клавіатурі або напиши правильно. 📝

source: Превышен лимит символов. Пожалуйста, сократи сообщение. ✂️
es: Se ha superado el límite de caracteres. Por favor, acorte el mensaje. ✂️
fr: La limite de caractères a été dépassée. Veuillez raccourcir le message. ✂️
id: Melebihi batas karakter. Silakan perpendek pesanmu. ✂️
pl: Przekroczono limit znaków. Proszę skrócić wiadomość. ✂️
uk: Перевищено ліміт символів. Будь ласка, скоротіть повідомлення. ✂️

source: Такой город не найдет :(
fr: Vous ne trouverez pas de ville comme celle-ci :(
id: Kota tersebut tidak ditemukan :(
pl: Nie znajdziesz takiego miasta :(
uk: Таке місто не знайде :(

source: Неверный формат фотографии! Пожалуйста, загрузите изображение в правильном формате. 🖼️
es: ¡Formato de imagen incorrecto! Por favor, suba la imagen en el formato correcto. 🖼️
fr: Format d'image incorrect ! Veuillez télécharger l'image dans le bon format. 🖼️
id: Format foto salah! Silakan unggah gambar dengan format yang benar. 🖼️
pl: Nieprawidłowy format zdjęcia! Proszę przesłać obraz w odpowiednim formacie. 🖼️
uk: Неправильний формат фотографії! Будь ласка, завантажте зображення в правильному форматі. 🖼️

source: Неверный формат, возраст нужно указывать цифрами. 🔢
es: Formato incorrecto, la edad debe darse en números. 🔢
fr: Format incorrect, l'âge doit être indiqué en chiffres. 🔢
id: Format salah, umur harus ditulis dengan angka. 🔢
pl: Nieprawidłowy format, wiek należy podać jako liczbę. 🔢
uk: Неправильний формат, вік потрібно вказувати цифрами. 🔢

source: Приглашай друзей и получай бонусы! Приглашенные пользователи: <b>{}</b> Ссылка для друзей: <code>{}</code>
fr: Invitez vos amis et obtenez des bonus ! Utilisateurs invités : <b>{}</b> Amis Lien : <code>{}</code>
id: Undang teman dan dapatkan bonus! Pengguna yang diundang: <b>{}</b> Tautan untuk teman: <code>{}</code>
pl: Zaproś znajomych i zgarnij bonusy! Zaproszeni użytkownicy: <b>{}</b> Link dla znajomych: <code>{}</code>
uk: Запрошуй друзів та отримуй бонуси! Запрошені користувачі: <b>{}</b> Посилання для друзів: <code>{}</code>

source: Наш канал: {}
fr: Notre chaîne : {}
id: Channel kami: {}
pl: Nasz kanał: {}

source: Выбери язык бота, на который хочешь переключиться: 🌐
es: Elige el idioma del bot al que quieres cambiar: 🌐
fr: Choisissez la langue du robot vers laquelle vous souhaitez basculer: 🌐
id: Pilih bahasa bot yang ingin kamu gunakan: 🌐
pl: Wybierz język bota, na który chcesz się przełączyć: 🌐
uk: Обери мову бота, на яку хочеш переключитися: 🌐

source: Язык бота изменён! ✅
fr: La langue bot a changé ! ✅
id: Bahasa bot telah diubah! ✅
pl: Zmieniono język bota! ✅
uk: Мова бота змінена! ✅

source: Укажи причину жалобы: 🔞 Неприличный контент 💰 Реклама 🔫 Другое ↩️ Назад
fr: Indiquez la raison de votre plainte : 🔞 Contenu inapproprié 💰 Publicité 🔫 Autre ↩️ Retour
id: Tulis alasan laporan: 🔞 Konten tidak pantas 💰 Iklan 🔫 Lainnya ↩️ Kembali
pl: Podaj powód skargi: 🔞 Nieprzyzwoite treści reklama 🔫 Inne ↩️ Wstecz
uk: Вкажи причину скарги: 🔞 Непристойний контент 💰 Реклама 🔫 Інше ↩️ Назад

source: ✅ Жалоба успешно отправлена на рассмотрение!
fr: ✅ La plainte a été envoyée avec succès pour examen !
id: ✅ Laporan berhasil dikirim untuk ditinjau!
pl: reklamacja została pomyślnie wysłana do rozpatrzenia!
uk: ✅ Скарга успішно відправлена на розгляд!

source: Загрузи новые фото! Можно отправить до 3 фотографий 📸
fr: Téléchargez de nouvelles photos ! Vous pouvez envoyer jusqu'à 3 photos 📸
id: Unggah foto baru! Kamu bisa mengirim hingga 3 foto 📸
pl: Prześlij nowe zdjęcia! Możesz wysłać do 3 zdjęć 📸
uk: Завантаж нові фото! Можна надіслати до 3 фото 📸

source: Фотографии остались без изменений
fr: Les photos restent inchangées
id: Foto tidak berubah
pl: Zdjęcia pozostały bez zmian
uk: Фотографії залишилися без змін

source: Вы не загрузили ни одного фото. Попробуйте еще раз.
fr: Vous n'avez pas téléchargé de photos. Réessayez.
id: Kamu belum mengunggah foto. Silakan coba lagi.
pl: Nie przesłałeś żadnego zdjęcia. Spróbuj ponownie.
uk: Ви не завантажили жодного фото. Спробуйте ще раз.

source: ❌ Ошибка при сохранении фото. Попробуйте еще раз.
fr: ❌ Erreur lors de l'enregistrement d'une photo. Réessayez.
id: ❌ Gagal menyimpan foto. Silakan coba lagi.
pl: ❌ Błąd podczas zapisywania zdjęcia. Spróbuj ponownie.
uk: ❌ Помилка під час збереження фото. Спробуйте ще раз.

source: Это все, сохранить фото
fr: C'est tout, gardez la photo
id: Selesai, simpan foto
pl: To wszystko, zachowaj zdjęcie
uk: Це все, зберегти фото

source: 📸 Фото {current}/{total} загружено! Можете загрузить еще {remaining} фото или нажать '{finish_button}'
fr: 📸 Photo {current}/{total} téléchargée ! Vous pouvez télécharger encore {remaining} photo(s) ou appuyer sur '{finish_button}'
id: 📸 Foto {current}/{total} diunggah! Kamu bisa mengunggah {remaining} foto lagi atau klik '{finish_button}'
pl: 📸 Zdjęcie {current}/{total} zostało przesłane! Możesz przesłać jeszcze {remaining} zdjęcie(a) lub nacisnąć '{finish_button}'
uk: 📸 Фото {current}/{total} завантажено! Можете завантажити ще {remaining} фото або натиснути '{finish_button}'

source: Сохранено {} фото!
fr: {} photo(s) enregistrée(s) !
id: {} foto disimpan!
pl: Zapisano {} zdjęcie(a)!
uk: Збережено {} фото!

source: Все {} фото загружены!
fr: Toutes les {} photos ont été téléchargées !
id: Semua {} foto diunggah!
pl: Wszystkie {} zdjęcia zostały przesłane!
uk: Всі {} фото завантажено!

source: ❌ Максимум 3 фото! Нажмите 'Это все, сохранить фото' для сохранения.
fr: ❌ Maximum 3 photos ! Appuyez sur 'C'est tout, enregistrer la photo' pour sauvegarder.
id: ❌ Maksimal 3 foto! Klik 'Selesai, simpan foto' untuk menyimpan.
pl: ❌ Maksymalnie 3 zdjęcia! Naciśnij 'To wszystko, zapisz zdjęcie' aby zapisać.
uk: ❌ Максимум 3 фото! Натисніть 'Це все, зберегти фото' для збереження.

source: 📸 Отправьте фотографию или выберите действие из меню
fr: 📸 Envoyez une photo ou choisissez une action dans le menu
id: 📸 Kirim foto atau pilih aksi dari menu
pl: 📸 Prześlij zdjęcie lub wybierz akcję z menu
uk: 📸 Надішліть фотографію або оберіть дію з меню

source: ❌ Для создания профиля необходимо загрузить хотя бы одно фото!
fr: ❌ Pour créer un profil, vous devez télécharger au moins une photo !
id: ❌ Untuk membuat profil, kamu harus mengunggah minimal satu foto!
pl: ❌ Aby utworzyć profil, musisz przesłać co najmniej jedno zdjęcie!
uk: ❌ Для створення профілю необхідно завантажити щонайменше одне фото!

source: ⏳ Вы отправляете сообщения слишком часто. Пожалуйста, подождите пару секунд.
fr: ⏳ Vous envoyez des messages trop fréquemment. Veuillez patienter quelques secondes.

source: Создать анкету
es: Créer un profil
fr: Créer un profil
id: Buat profil
pl: Utwórz profil
uk: Створити анкету

source: Парень
es: Chico
fr: Garçon
id: Laki-laki
pl: Chłopak
uk: Хлопець

source: Девушка
es: Chica
fr: Fille
id: Perempuan
pl: Dziewczyna
uk: Дівчина

source: Парней
es: Chicos
fr: Garçons
id: Laki-laki
pl: Chłopców
uk: Хлопців

source: Девушек
es: Chicas
fr: Filles
id: Perempuan
pl: Dziewcząt
uk: Дівчат

source: Всех
es: Todos
fr: Tous
id: Semua
pl: Wszyscy
uk: Усіх

source: Оставить предыдущее
es: Laisser le précédent
fr: Laisser le précédent
id: Biarkan yang sebelumnya
pl: Pozostaw poprzednie
uk: Залишити попереднє

source: Пропустить
fr: Passer
id: Lewati
uk: Пропустити

source: 📍 Отправить местоположение
fr: 📍 Envoyer le lieu
id: 📍 Kirim lokasi
pl: 📍 Wyślij lokalizację
uk: 📍 Надіслати місцеположення

source: 🚀 Открыть WebApp
fr: 🚀 Ouvrir l'application Web

source: Посмотреть
es: Ver
fr: Voir
id: Lihat
pl: Patrzeć
uk: Подивитися

source: На ваш лайк ответили взаимно, надеюсь вы хорошо проведете время ;) <a href='{}'>{}</a>
id: Like kamu dibalas, semoga kalian bersenang-senang ;) <a href='{}'>{}</a>
pl: Twoje polubienie zostało odwzajemnione, mam nadzieję, że dobrze się bawiłeś ;) <a href='{}'>{}</a>
uk: На ваш лайк відповіли взаємно, сподіваюся ви добре проведете час ;) <a href='{}'>{}</a>

source: Привет! 👋 Добро пожаловать в наш Telegram-бот для знакомств! 💕 Чтобы начать, создай свой профиль 🚀 Желаем приятных знакомств! 😊
es: Hola 👋 ¡Bienvenido a nuestro bot de citas de Telegram! 💕 Para empezar, crea tu perfil 🚀. ¡Te deseamos una agradable experiencia de citas! 😊

source: 🔍 Смотреть анкеты 👤 Моя анкета 🗄 Посмотреть лайки ✉️ Пригласить друзей
es: 🔍 Ver perfiles 👤 Mi perfil 🗄 Ver me gusta ✉️ Invitar amigos

source: 🔄 Заполнить анкету заново 🖼 Изменить фотографию ✍️ Изменить описание ❌ Отключить анкету 🔍 Смотреть анкеты
es: 🔄 Rellenar de nuevo el formulario 🖼 Cambiar foto ✍️ Cambiar la descripción ❌ Desactivar perfil 🔍 Ver perfiles

source: Подходящих анкет нет. Попробуй указать другой город. 🌍
es: No hay perfiles adecuados. Prueba a especificar otra ciudad. 🌍

source: Больше анкет нет. Попробуйте позже! 😊
es: No hay más perfiles. ¡Vuelve a intentarlo más tarde! 😊

source: Кому-то понравилась тваоя анкета! Хочешь посмотреть? 👀
es: ¡A alguien le ha gustado tu perfil! Te gustaría verlo? 👀

source: Тебя ещё никто не лайкнул, но всё впереди!
es: Aún no te han gustado, ¡pero lo tienes todo por delante!

source: Отлично! Надеюсь хорошо проведете время ;) <a href='{}'>{}</a>
es: Отлично! Espero que te diviertas ;) <a href='{}'>{}</a>

source: Пришли своё фото! 📸
es: ¡Envía tu foto! 📸

source: Расскажи немного о себе! Это поможет другим лучше тебя узнать. 📝
es: Háblenos un poco de usted. Ayudará a los demás a conocerte mejor. 📝

source: Твоя анкета временно отключена. Чтобы снова её активировать, просто нажми на кнопку. 😊
es: Su perfil ha sido desactivado temporalmente. Para reactivarlo, solo tienes que hacer clic en el botón. 😊

source: Приглашай друзей и получай бонусы! Приглашенные пользователи: <b>{}</b> Ссылка для друзей: <code>https://t.me/{}?start={}</code>
es: ¡Invita a tus amigos y consigue bonificaciones! Usuarios invitados:<b>{}</b>\ Enlace para amigos: <code>https://t.me/{}?start={}</code>

source: Ты администратор!
es: ¡Tú eres el administrador!

source: Язык бот изменён! ✅
es: ¡Se ha cambiado el bot de idioma! ✅

source: Новый пользователь! <code>{}</code> (@{})
es: ¡Nuevo usuario !

source: Пользователь <code>{}</code> (@{}) отправил жалобу на анкету пользователя: <code>{}</code> (@{})
es: El usuario <code>{}</code> (@{}) envió una queja sobre un perfil de usuario: <code>{}</code> (@{})

source: Панель управления пользователями:
es: Panel de control del usuario:

source: 💊 Пожалуйста, укажи список ID пользователей через запятую для разблокировки. Пример: 1234567, 234567
es: 💊 Especifique una lista separada por comas de los ID de usuario que desea desbloquear. Ejemplo: 1234567, 234567

source: ⚔️ Пожалуйста, укажи список ID пользователей через запятую для блокировки. Пример: 1234567, 234567
es: ⚔️ Especifique una lista separada por comas de los ID de usuario que desea bloquear. Ejemplo: 1234567, 234567

source: Пользователь: <code>{}</code> заблокирован
es: Usuario: <code>{}</code> bloqueado

source: Администратор отклонил жалобу
es: El administrador rechazó la reclamación

source: Укажи текст сообщения которое будет отправленно
es: Especifique el texto del mensaje que desea enviar

source: ✅ Жалоба отправлена на рассмотрение!
es: ✅ ¡Queja enviada para revisión!

source: Укажи причину жалобы: 🔞 Неприличный материал 💰 Реклама 🔫 Другое Если жалоба ошибочная, то можете вернутся назад.
es: Indique el motivo de la denuncia: 🔞 Material indecente 💰 Publicidad 🔫 Otro Si la denuncia es errónea, puedes volver atrás.

source: 📊 Статистика
es: 📊 Estadísticas

source: 👤 Пользователи
es: 👤 Usuarios

source: 📩 Рассылка
es: 📩 Boletines

source: ⚔️ Забанить пользователей
es: ⚔️ Prohibir usuarios

source: 🔙 Вернуть профиль
es: 🔙 Perfil de retorno

source: Отменить жалобу
es: Anulación de la denuncia

source: ☠️ Заблокировать пользователя {}
es: ☠️ Bloquear usuario {}

source: Отклонить
es: Rechazar

source: Начать
es: Inicio

source: Изменить язык бота
es: Cambiar el idioma del bot

source: Дополнительное описание
es: Descripción adicional

source: Активировать анкету
es: Activar el formulario

source: Админ панель
es: panel de administración

source: Статистика
es: Estadísticas
