from loader import _

# Текста было много и он повторялся. 
# По этой причине вынеc в отдельный файл :)

class MsgText:
    @property
    def WELCOME(self):
        return _(
            """
Привет! 👋

Добро пожаловать в наш Telegram-бот для знакомств! 💬 Чтобы начать, тебе нужно создать свой профиль. Напиши команду /create или просто нажми на неё. 🚀

Создай профиль и начни знакомиться с новыми людьми прямо сейчас!
"""
        )

    @property
    def MENU(self):
        return _(
            """
🔍 Искать анкеты
👤 Мой профиль
🗄 Посмотреть лайки

✉️ Пригласить друзей \n"""
        )

    @property
    def PROFILE_MENU(self):
        return _(
            """
🔄 Заполнить анкету заново
🖼 Изменить фотографию
✍️ Изменить описание
❌ Удалить анкету

🔍 Смотреть анкеты
"""
        )

    @property
    def INFO(self):
        return _(
            """
👋
Немного информации о боте:
Этот бот был создан по аналогии с популярным ботом для знакомств <a href='https://t.me/leomatchbot?start=i_VwRd0'>Дайвинчик</a>
Весь код бота открыт и доступен на <a href='https://github.com/devvsima/dating-bot'>GitHub</a>
Некоторую статистику можно глянуть по команде /stats

По вопросам и предложениям можно писать сюда: @devvsima.
"""
        )

    @property
    def SEARCH(self):
        return _("Идет поиск...")

    @property
    def INVALID_PROFILE_SEARCH(self):
        return _("Подходящих вам анкет нет. Вы можете попробовать указать другой город. 🌍")

    @property
    def EMPTY_PROFILE_SEARCH(self):
        return _("Больше анкет нет. Попробуй позже! 😊")

    @property
    def LIKE_PROFILE(self):
        return _("Кому-то понравилась ваша анкета! Хотите посмотреть? 👀")

    @property
    def LIKE_ARCHIVE(self):
        return _("Тебя еще никто не лайкнул. Но всё ещё впереди!")

    @property
    def LIKE_ACCEPT(self):
        return _("Отлично! Надеюсь хорошо проведете время ;) <a href='tg://user?id={}'>{}</a>")

    @property
    def GENDER(self):
        return _("Укажи свой пол: 👤")

    @property
    def FIND_GENDER(self):
        return _("Кто тебе интересен? Выбери пол человека: 👤")

    @property
    def PHOTO(self):
        return _("Пришли своё фото! 📸")

    @property
    def NAME(self):
        return _("Как тебя зовут? Напиши своё имя, чтобы мы могли продолжить! ✍️")

    @property
    def AGE(self):
        return _("Сколько тебе лет? Укажи свой возраст, пожалуйста! 🎂")

    @property
    def CITY(self):
        return _("Теперь введи свой город. 🏙️")

    @property
    def DESCRIPTION(self):
        return _("Расскажи немного о себе! Это поможет другим лучше тебя узнать. 📝")

    @property
    def DELETE_PROFILE(self):
        return _("Вы точно хотите удалить анкету?")

    @property
    def DELETE_PROFILE_ALERT(self):
        return _("Ваша анкета успешно удалена.\n\nЕсли хотите снова создать вашу анкету напиши команду /create")

    @property
    def INVALID_RESPONSE(self):
        return _("Некорректный ответ. Пожалуйста, выбери на клавиатуре или напиши правильно. 📝")

    @property
    def INVALID_LONG_RESPONSE(self):
        return _("Превышен лимит символов. Пожалуйста, сократи сообщение. ✂️")

    @property
    def INVALID_PHOTO(self):
        return _("Неверный формат фотографии! Пожалуйста, загрузите изображение в правильном формате. 🖼️")

    @property
    def INVALID_AGE(self):
        return _("Неверный формат, возраст нужно указывать цифрами. 🔢")

    @property
    def INVITE_FRIENDS(self):
        return _("Приглашай друзей и получай бонус к своей анкете!\n\nСсылка для друзей:\n<code>https://t.me/{}?start={}</code>")

msg_text = MsgText()